{
    "site": {
        "title": "Obscura - Developer Tools",
        "copyright": "© 2026 Obscura. JJH"
    },
    "header": {
        "switchTheme": "Switch Theme",
        "switchLang": "Switch Language"
    },
    "tools": {
        "environment": "Environment",
        "environmentDesc": "Modify browser runtime environment to fake browser fingerprints",
        "antidebug": "Anti-Debug",
        "antidebugDesc": "Detect and prevent debugging",
        "devtools": "Tools",
        "devtoolsDesc": "Collection of common developer tools",
        "placeholder4": "Placeholder 4",
        "placeholder4Desc": "This is a reserved tool position",
        "placeholder5": "Placeholder 5",
        "placeholder5Desc": "This is a reserved tool position",
        "placeholder6": "Placeholder 6",
        "placeholder6Desc": "This is a reserved tool position",
        "placeholder7": "Placeholder 7",
        "placeholder7Desc": "This is a reserved tool position",
        "placeholder8": "Placeholder 8",
        "placeholder8Desc": "This is a reserved tool position"
    },
    "env": {
        "back": "Back",
        "hooks": "Object Hooks",
        "hooksDesc": "Intercept and modify object property read/write operations",
        "functions": "Function Fix",
        "functionsDesc": "Fix function return values or modify function behavior",
        "fingerprint": "Fingerprint Config",
        "fingerprintDesc": "Fake browser fingerprint information",
        "async": "Async Interception",
        "asyncDesc": "Intercept and modify async operation results"
    },
    "ad": {
        "debugger": "Debugger",
        "debuggerDesc": "Detect and prevent debugger activity",
        "console": "Console",
        "consoleDesc": "Detect console open status"
    },
    "modal": {
        "title": "Notice",
        "body": "This feature is under development, please stay tuned!",
        "ok": "OK"
    },
    "disclaimer": {
        "title": "Disclaimer",
        "intro": "This software (hereinafter referred to as \"the Tool\") is a secondary development and customization based on the Chromium open source project, designed to provide technical assistance for legitimate software development, debugging, security research, and educational purposes. Before using the Tool, please carefully read and fully understand this disclaimer. By installing, copying, downloading, accessing, or using any part of the Tool, you unconditionally accept and agree to comply with all terms of this disclaimer.",
        "legalTitle": "1. Legal Use and Compliance",
        "legalContent": "The functions provided by the Tool (including but not limited to environment masking, anti-debugging, network proxy, code analysis, etc.) are only for: compatibility testing and debugging by software developers for their own products; security researchers conducting security assessments on systems and applications within authorized scope; academic research and technical learning, not for infringing upon others' legitimate rights and interests; other behaviors that comply with applicable laws, regulations, and ethical standards. You commit to strictly abide by the laws and regulations of your country or region when using the Tool, and respect others' intellectual property rights, privacy rights, and other legitimate rights. You shall not use the Tool for any illegal activities, including but not limited to: bypassing anti-crawling mechanisms of websites without authorization to obtain non-public data; forging identities or device fingerprints for fraud, false clicks, malicious orders, etc.; interfering with or disrupting normal network services, or launching attacks on others' computer systems; other acts that may violate laws or service agreements.",
        "noWarrantyTitle": "2. No Warranty Statement",
        "noWarrantyContent": "The Tool is provided on an 'AS IS' and 'AS AVAILABLE' basis, without any express or implied warranties. The developers and contributors do not guarantee that: the Tool's functions will fully meet your expectations or satisfy specific needs; the Tool will not experience interruptions, errors, or security vulnerabilities during operation; the results obtained from using the Tool are absolutely accurate, reliable, or usable. To the maximum extent permitted by law, the developers and contributors hereby disclaim any implied warranties, including but not limited to warranties of merchantability, fitness for a particular purpose, and non-infringement.",
        "liabilityTitle": "3. Limitation of Liability",
        "liabilityContent": "Under no circumstances shall developers, contributors, or related parties be liable for any direct, indirect, incidental, special, punitive, or consequential damages arising from the use or inability to use the Tool, including but not limited to loss of profits, data loss, business interruption, or reputational damage, even if such possibility has been notified. If your jurisdiction does not allow the above limitation of liability, such limitation may not apply to you, but only to the extent required by mandatory laws of that jurisdiction.",
        "thirdPartyTitle": "4. Third-Party Links and Content",
        "thirdPartyContent": "The Tool may contain links to third-party websites or resources, or allow you to access third-party content. These links are provided solely for your convenience and do not represent endorsement, guarantee, or control of third-party content by the developers. You access any third-party links or use any third-party services at your own risk and shall comply with the applicable terms and policies of such third parties. Developers shall not be liable for any issues arising from third-party content or services.",
        "ipTitle": "5. Intellectual Property",
        "ipContent": "The intellectual property rights of the Tool's source code, documentation, and related resources (excluding dependent open source components) belong to the developers and are licensed under corresponding open source licenses (such as BSD, MIT, etc.). When using the Tool, you should respect and comply with the provisions of relevant open source licenses. Without authorization, you shall not remove or modify any copyright notices. The Tool allows you to modify the source code to suit your own needs, but the modified version must include the original copyright notice and this disclaimer, and shall not imply that developers endorse your modified version.",
        "obligationTitle": "6. User Obligations and Indemnification",
        "obligationContent": "You agree to bear all risks and responsibilities arising from your use of the Tool. If you violate this disclaimer or relevant laws and regulations, resulting in any third-party claims, lawsuits, or demands, or causing developers to suffer any losses (including reasonable attorneys' fees), you agree to indemnify, defend, and hold harmless developers and their affiliates.",
        "modifyTitle": "7. Modification and Termination",
        "modifyContent": "Developers reserve the right to modify this disclaimer, update features, or terminate the Tool at any time without prior notice. You have the obligation to regularly review this disclaimer. Your continued use of the Tool after changes are published shall be deemed acceptance of the updated terms.",
        "otherTitle": "8. Others",
        "otherContent": "The interpretation, validity, and dispute resolution of this disclaimer shall be governed by the laws of the People's Republic of China. Any disputes arising from the Tool shall be resolved through friendly negotiations; if negotiation fails, either party may file a lawsuit with the people's court with jurisdiction at the developer's location. If any part of this disclaimer is determined to be invalid or unenforceable, the remaining parts shall remain in full force and effect.",
        "specialNote": "Special Notice: You understand and confirm that any technical tool is neutral in nature, and its use depends on the user's behavior. Developers do not intend to encourage or condone any illegal or improper use, nor shall they be liable for the legal consequences arising from user behavior. Please use the Tool prudently within legal and compliant boundaries. If you do not agree with any terms of this disclaimer, please immediately stop downloading, installing, or using the Tool and completely delete all related files.",
        "agree": "Agree",
        "disagree": "Disagree"
    }
}
