{
    "site": {
        "title": "Obscura - 开发者工具",
        "copyright": "© 2026 Obscura. JJH"
    },
    "header": {
        "switchTheme": "切换主题",
        "switchLang": "切换语言"
    },
    "tools": {
        "environment": "环境",
        "environmentDesc": "修改浏览器运行时环境，伪造浏览器指纹",
        "placeholder2": "占位工具 2",
        "placeholder2Desc": "这是一个预留的工具位置",
        "placeholder3": "占位工具 3",
        "placeholder3Desc": "这是一个预留的工具位置",
        "placeholder4": "占位工具 4",
        "placeholder4Desc": "这是一个预留的工具位置",
        "placeholder5": "占位工具 5",
        "placeholder5Desc": "这是一个预留的工具位置",
        "placeholder6": "占位工具 6",
        "placeholder6Desc": "这是一个预留的工具位置",
        "placeholder7": "占位工具 7",
        "placeholder7Desc": "这是一个预留的工具位置",
        "placeholder8": "占位工具 8",
        "placeholder8Desc": "这是一个预留的工具位置"
    },
    "env": {
        "back": "返回",
        "hooks": "对象钩子",
        "hooksDesc": "拦截并修改对象属性的读取和写入操作",
        "functions": "函数固定",
        "functionsDesc": "固定函数返回值或修改函数行为",
        "fingerprint": "指纹配置",
        "fingerprintDesc": "伪造浏览器指纹信息",
        "async": "异步拦截",
        "asyncDesc": "拦截并修改异步操作的结果"
    },
    "modal": {
        "title": "提示",
        "body": "此功能正在开发中，敬请期待！",
        "ok": "确定"
    },
    "disclaimer": {
        "title": "免责声明",
        "intro": "本软件（以下简称\"本工具\"）是基于 Chromium 开源项目进行的二次开发与定制，旨在为合法的软件开发、调试、安全研究及教育目的提供技术辅助。在使用本工具前，请务必仔细阅读并充分理解本免责声明。您安装、复制、下载、访问或使用本工具的任何部分，即表示您已无条件接受并同意遵守本声明的全部条款。",
        "legalTitle": "1. 合法用途与合规性",
        "legalContent": "本工具提供的功能（包括但不限于环境伪装、反调试、网络代理、代码分析等）仅可用于以下场景：软件开发者对自身产品的兼容性测试与调试；安全研究人员在授权范围内对系统、应用的安全性评估；学术研究与技术学习，不得用于侵犯他人合法权益；其他符合适用法律法规及道德规范的行为。您承诺使用本工具时，将严格遵守所在国家或地区的法律法规，尊重他人的知识产权、隐私权及其他合法权益。您不得利用本工具从事任何违法活动，包括但不限于：未经授权绕过网站的反爬虫机制，获取非公开数据；伪造身份或设备指纹进行欺诈、虚假点击、恶意刷单等；干扰、破坏网络服务正常运行，或对他人计算机系统发起攻击；其他可能触犯法律或违反服务协议的行为。",
        "noWarrantyTitle": "2. 无担保声明",
        "noWarrantyContent": "本工具按\"现状\"和\"可提供性\"原则提供，不附带任何明示或暗示的担保。开发者及贡献者不保证：本工具的功能完全符合您的预期或满足特定需求；本工具在运行中不会出现中断、错误或安全漏洞；使用本工具获得的结果绝对准确、可靠或可用。在法律允许的最大范围内，开发者及贡献者特此声明不承担任何默示担保，包括但不限于适销性、特定用途适用性及不侵权的担保责任。",
        "liabilityTitle": "3. 责任限制",
        "liabilityContent": "在任何情况下，开发者、贡献者及相关方均不对因使用或无法使用本工具而导致的任何直接、间接、附带、特殊、惩罚性或后果性损害承担责任，包括但不限于利润损失、数据丢失、业务中断或商誉受损，即使已被告知此类损害的可能性。若您所在司法管辖区不允许上述责任限制，则相关限制可能不适用于您，但仅限于该辖区法律强制要求的范围。",
        "thirdPartyTitle": "4. 第三方链接与内容",
        "thirdPartyContent": "本工具可能包含指向第三方网站或资源的链接，或允许您访问第三方内容。这些链接仅为方便您使用而提供，不代表开发者对第三方内容的认可、担保或控制。您访问任何第三方链接、使用任何第三方服务均需自行承担风险，并遵守该第三方适用的条款与政策。开发者对第三方内容或服务引发的任何问题不承担任何责任。",
        "ipTitle": "5. 知识产权",
        "ipContent": "本工具本身的源代码、文档及相关资源（除所依赖的开源组件外）的知识产权归开发者所有，遵循相应的开源许可证（如BSD、MIT等）。您在使用本工具时，应尊重并遵守相关开源协议的规定。未经授权，不得移除或修改任何版权声明。本工具允许您修改源代码以适应自身需求，但修改后的版本仍需包含原版权声明及本免责声明，且不得以任何方式暗示开发者对您的修改版本进行背书。",
        "obligationTitle": "6. 用户义务与赔偿",
        "obligationContent": "您同意独自承担因使用本工具而产生的所有风险与责任。若因您违反本免责声明或相关法律法规，导致任何第三方提出索赔、诉讼或要求，或使开发者遭受任何损失（包括合理的律师费），您同意对开发者及其关联方进行赔偿、辩护并使其免受损害。",
        "modifyTitle": "7. 修改与终止",
        "modifyContent": "开发者保留随时修改本免责声明、更新功能或终止本工具提供的权利，恕不另行通知。您有义务定期查阅本声明，变更发布后您继续使用本工具即视为接受更新后的条款。",
        "otherTitle": "8. 其他",
        "otherContent": "本免责声明的解释、效力及争议解决均适用中华人民共和国法律。因本工具引起的任何争议，双方应友好协商解决；协商不成的，任何一方均可向开发者所在地有管辖权的人民法院提起诉讼。如本声明的任何部分被认定为无效或不可执行，其余部分仍应保持完全效力。",
        "specialNote": "特别提示：您理解并确认，任何技术工具本身具有中立性，其用途取决于使用者的行为。开发者无意鼓励或纵容任何非法或不当使用，也不对使用者行为引发的法律后果承担责任。请在合法合规的前提下审慎使用本工具。若您不同意本免责声明的任何条款，请立即停止下载、安装或使用本工具，并彻底删除所有相关文件。",
        "agree": "同意",
        "disagree": "不同意"
    }
}
